package com.academy.Lesson03.HomeWork.StringAndArray;

//1) Напишите программу, которая:
//	- считывает строку
//	- выводит исходную строку
//	- выводит количество и список слов, которые начинаются на букву 'd'

public class Task01Mine {
    public static void main(String[] args) {

        Task01Method.OutputString("Hello World!!!");
        int numder = Task01Method.OutputWordsD("dfall dgtdt ddhfdd doir drop assd hffccdhh doitdduujfjnfn hghrk dnytkjf dddff");

        System.out.println("Number of words starting with \"d\"  = " + numder);
    }





}
