package com.academy.Lesson03.HomeWork.StringAndArray;

import javax.swing.*;

//9) –еализовать программу, котора€:
//	- в диалоговом режиме запрашивает размер двумерного массива
//	- в диалоговом режиме считывает элементы массива (дробные трехзначные числа с двум€ знаками после зап€той)
//	- выводите массив в виде отформатированном виде (оставл€€ два знака после зап€той), напр. дл€ массива размером 3:
//
//		|3.14   2.7    124.45|
//		|15.55  112.76 4.45  |
//		|5      0      -66   |
//
//	- определ€ет и выводит на экран:
//		-- минимальный элемент (-66)
//		-- максимальный (124.45)
//		-- номер строки, сумма элементов которой максимальна (в данном примере 2-а€ строка)
//		-- номер строки, сумма которых минимальна (в данном примере 3)
public class Task09Main {
    public static void main(String[] args) {
        Task09Method.OpenWindowSize();
    }
}
